Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotPasteRoomsInNonPlanViews Property
 [Rooms] can only be pasted in Plan or Ceiling Plan views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPasteRoomsInNonPlanViews { get; }
Public Shared ReadOnly Property CannotPasteRoomsInNonPlanViews As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPasteRoomsInNonPlanViews {
	FailureDefinitionId^ get ();
}
static member CannotPasteRoomsInNonPlanViews : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace